const SENTENCES = [
	'ต้องรอ__นาทีนะคะ',
	'แมว__ตัวกินอาหารหมดเลยค่ะ',
	'อันนี้__บาทค่ะ',
	'ฉันอายุ__ปีค่ะ',
	'วันนี้มีนักเรียน__คนค่ะ',
	'ขอน้ำเปล่า__ขวดได้ไหมคะ',
	'บ้านอยู่ห่างจากที่นี่__กิโลเมตรค่ะ',
	'ฉันอยู่ที่นี่มา__วันแล้วค่ะ',
	'พรุ่งนี้อากาศ__องศาค่ะ',
	'ลดราคา__เปอร์เซ็นต์ค่ะ',
	'ซื้อไข่__ฟองค่ะ',
	'ห้องประชุมอยู่ชั้น__ค่ะ',
	'ฉันซื้อส้ม__ลูกค่ะ',
	'มีหนังสือ__เล่มบนโต๊ะค่ะ',
	'ฉันโทรหาคุณ__ครั้งแล้วนะคะ',
	'เจอกันวันที่__นะคะ',
	'ฉันอยู่ห้องเลขที่__ค่ะ',
	'ขอเมนูหมายเลข__ค่ะ',
];
let sentenceIndex = 0;

export const getSentence = (number: string) => {
	let sentence = SENTENCES[sentenceIndex];
	sentence = sentence.replace('__', number);

	return sentence;
};
export const advanceSentence = () => {
	sentenceIndex = (sentenceIndex + 1) % SENTENCES.length;
};
